added some bonus features
